awesome-answers/app/controllers/api/v1/questions_controller.rb

    def index
        questions = Question.order created_at: :desc
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

    def destroy
        #question = Question.find params[:id]
        if @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]

    def create
        question = Question.new question_params
        question.user = current_user
        if question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "view_count", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Fasfasa"], ["body", "fafafafsafaafasfafafaa"], ["created_at", "2021-05-23 22:07:38.823352"], ["updated_at", "2021-05-23 22:07:38.823352"], ["view_count", 0], ["user_id", 1]]

    def update
        if @question.update question_params
---
UPDATE "questions" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "Testing postman 4"], ["body", "Body on Postman 4"], ["updated_at", "2021-05-18 18:25:15.786825"], ["id", 201]]

    def find_question
        @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 205], ["LIMIT", 1]]