awesome-answers/app/models/question.rb

SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "Test Postman Tag"], ["LIMIT", 1]]
---
  def tag_names=(new_tags)
    self.tags = new_tags.strip.split(/\s*,\s*/).map do |tag_name|