awesome-answers/app/views/questions/show.html.erb

  |
  <%= pluralize(@question.likes.count, "like") %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."question_id" = $1  [["question_id", 202]]

  <%#
    @question.tags.map { |tag| tag.name }.join(", ")
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."question_id" = $1  [["question_id", 202]]

  %>
  <% @question.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."question_id" = $1  [["question_id", 202]]