awesome-answers/app/serializers/question_serializer.rb

  def like_count
    object.likes.count
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."question_id" = $1  [["question_id", 13]]