awesome-answers/app/controllers/questions_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 202]]
SELECT "likes".* FROM "likes" WHERE "likes"."question_id" = $1 AND "likes"."user_id" IS NULL LIMIT $2  [["question_id", 202], ["LIMIT", 1]]
---
  def show
    # For form_with
    @answer = Answer.new

    # For list of answers to display
    @answers = @question.answers.order(created_at: :desc)

    # Finds the like of the question by the current_user
    # If user did not previously like, @like will be nil
    @like = @question.likes.find_by(user: current_user)

SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC
---
  def index
    if params[:tag].present?
      @tag = Tag.find_or_initialize_by(name: params[:tag])
      @questions = @tag.questions.order(created_at: :desc)
    else
      @questions = Question.all.order(created_at: :desc)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 202], ["LIMIT", 1]]
---
  def find_question
    @question = Question.find params[:id]